_static/soap_outputs/6.2.314.3321/ask_manual_question_complex_query2_step_8_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>AddObject</command>
      <object_list>
        <question>
          <group>
            <and_flag>0</and_flag>
            <filters>
              <filter>
                <not_flag>0</not_flag>
                <value>.*Google (Search|Chrome).*</value>
                <ignore_case_flag>1</ignore_case_flag>
                <operator>RegexMatch</operator>
                <sensor>
                  <hash>1511329504</hash>
                </sensor>
              </filter>
            </filters>
          </group>
          <selects>
            <select>
              <filter>
                <sensor>
                  <hash>3409330187</hash>
                </sensor>
              </filter>
              <sensor>
                <hash>3409330187</hash>
              </sensor>
            </select>
            <select>
              <filter>
                <sensor>
                  <hash>7318847</hash>
                </sensor>
              </filter>
              <sensor>
                <hash>7318847</hash>
              </sensor>
            </select>
            <select>
              <filter>
                <not_flag>0</not_flag>
                <value>.*Google (Search|Chrome).*</value>
                <operator>RegexMatch</operator>
                <sensor>
                  <hash>1511329504</hash>
                </sensor>
              </filter>
              <sensor>
                <hash>1511329504</hash>
              </sensor>
            </select>
          </selects>
        </question>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>